
#define BTN_STOP_ALARM    0

uint32_t Loop_1SecCounter;
bool LOOP_1Second = OFF;
uint32_t Loop_20mSecCounter;
bool LOOP_20mSec = OFF;
String receivedMessage = "";  // Variable to store the complete message
//bool Data_Int_Enable = OFF; // default PC MODE
bool PC_Serial_Mode = ON; // default PC MODE

uint8_t Mode;
//#define TEST_FRAG   1
//#define RUN_FRAG    0

//                  on,off,on,off minutes

/*
#define ARRAY_SIZE 30
struct
{
  uint16_t Volt;    // 31
  uint16_t Adc;   // 35
  int32_t Volt_32;
  uint16_t Array[ARRAY_SIZE];
  uint8_t Index;
  bool State;
  uint8_t Power; // 0 USB + BATTERY CHARGE  / 16   USB  + NO BATTERY    / 32 ONLY BATTERY
  uint16_t Max;
  uint16_t Min;
  uint16_t Diff; 
  uint32_t Median;
  uint16_t USB;
}Battery;

struct
{
  uint16_t Adc;
  uint8_t DAC;
  uint8_t Target_DAC;
  uint16_t Target_DAC_Volt;
  uint16_t DAC_Volt;
  uint32_t DAC_Volt32;
  uint16_t Actual_Fan_Volt;
  uint32_t Volt_32;
  uint32_t Fan_Target_Volt_32;
  uint16_t Fan_Target_Volt;
  uint16_t Control_Volt; 
  int16_t error; 
  int16_t error0; 
  bool State ; // ON OFF 
  //uint8_t Led_Pos;
  uint8_t Mode;
  uint8_t Mode_Prev;
  uint16_t Mode_Counter;  
}Boost;

*/

struct
{
  /*
  uint16_t Volt;    // 31
  uint16_t Adc;   // 35
  int32_t Volt_32;
 // uint16_t Array[MAX_NO];
  uint8_t Index;
  bool State;
  uint16_t Max;
  uint16_t Min;
  uint16_t Diff; 
  uint32_t Median;
*/
uint8_t High[4]= {8,5,5,5};
uint8_t Mid[4] = {5,5,5,5};
uint8_t Low[4] = {5,5,5,5};
  uint8_t LowSpeed;
  uint8_t HighSpeed;
   uint8_t MidSpeed; 
  uint32_t Pulse_High=0;
  uint32_t Pulse_Low=0;
  uint32_t Pulse_High_Latch=0;
  uint32_t Pulse_Low_Latch=0;
 // uint32_t Rotation;
  uint32_t Rpm;
  uint32_t  DutyCycle =50;  
  bool Error = OFF;
}Fan;




//int LED_STATE=LOW;
uint8_t LED_STATE;;
float Gas = 80.0;

  struct Sensor_BME688_Bosch
{
  float Temperature = 0;
  float Humidity = 0;  
  float Pressure = 0;
  float Gas = 0; 
  uint8_t Exists = 0; 
};




struct TaskOrg
{
  uint8_t  IntTimer_10 = 0;
  uint8_t  IntTimer_100 = 0;
  uint16_t  IntTimer_250 = 0;
  uint16_t  IntTimer_500 = 0;
  uint16_t  IntTimer_1_Sec = 0;
  uint16_t  IntTimer_2_Sec = 0;
  uint16_t  IntTimer_5_Sec = 0;
  uint16_t  IntTimer_10_Sec = 0;
  uint16_t  IntTimer_20_Sec = 0;
  uint16_t  IntTimer_60_Sec = 0;  
  bool Task_SameInt =0;
  bool Task_10msec =0;
  bool Task_100msec =0;
  bool Task_250msec =0;
  bool Task_500msec =0;
  bool Task_1Sec =0;
  bool Task_2Sec =0;
  bool Task_5Sec =0;
  bool Task_10Sec =0;
  bool Task_20Sec =0;
  bool Task_60Sec =0;
};
 TaskOrg Loop;

#define TASK_500MSEC  1
#define TASK_1SEC 2
#define TASK_2SEC 4
#define TASK_5SEC 8
#define TASK_10SEC 16
#define TASK_20SEC 32
#define TASK_60SEC 64

#define ON 1
#define OFF 0

struct
{
  /*
  float Humidity_OnBoard;
  float Temperature_OnBoard; // 27  
  float Humidity_Ch1;
  float Temperature_Ch1; // 27
  float Humidity_Ch2;
  float Temperature_Ch2; // 27
  float Humidity_Ch3;
  float Temperature_Ch3; // 27  
  float Current;
  float Voltage;
  float PowerFactor; 
  float ActivePower;
  float Frequency;
  float Pressure; //  
  float TemperatureBMP; //  
  float Altitude; //
  uint16_t Luminosity;  
  uint16_t FullSpectrum;
  uint16_t Infrared;
  int32_t DAQ_Temperature;
  int32_t DAQ_Humidity; 
  */

  bool Lux_Error= OFF;
  bool Temp_Error= OFF;
  bool TVoc_Error = OFF;    
  float Lux; 
  float Humidity;
  float Temperature; // 27   
  uint32_t TVoc;
}Values;

static const unsigned char PROGMEM logo16_glcd_bmp[] =
{ 0b00000000, 0b11000000,
  0b00000001, 0b11000000,
  0b00000001, 0b11000000,
  0b00000011, 0b11100000,
  0b11110011, 0b11100000,
  0b11111110, 0b11111000,
  0b01111110, 0b11111111,
  0b00110011, 0b10011111,
  0b00011111, 0b11111100,
  0b00001101, 0b01110000,
  0b00011011, 0b10100000,
  0b00111111, 0b11100000,
  0b00111111, 0b11110000,
  0b01111100, 0b11110000,
  0b01110000, 0b01110000,
  0b00000000, 0b00110000 };
  /*
//char Disp_MENU1[] =    {'L','O','G',' ','S','T','A','R','T',' ','&',' ','S','T','O','P',' ','M','E','N','U','\0'};
static const char Disp_MENU8_SUB1[] PROGMEM =      " Portable -> SD Card ";
static const char Disp_MENU8_SUB2[] PROGMEM =      "  PC  -> 115200 bps  ";
static const char Disp_MENU8_SUB3[] PROGMEM =      " Log Mode Updated !  ";
static const char Disp_MENU2_SUB[] PROGMEM = "Enter -> ";  //9
